# Parameters
nc: 20  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 0.5  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, ConvGN, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, ConvGN, [128, 3, 2]],  # 1-P2/4
   [-1, 1, MyTfBlock, [128, 16, 2, 8, 1]],
   [-1, 1, ConvGN, [256, 3, 2]],  # 3-P3/8
   [-1, 2, MyTfBlock, [256, 8, 4, 8, 2]],
   [-1, 1, ConvGN, [512, 3, 2]],  # 5-P4/16
   [-1, 3, MyTfBlock, [512, 4, 8, 8, 4]],
   [-1, 1, ConvGN, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, MyTfBlock, [1024, 2, 16, 8, 8]],
#   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, ConvGN, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, ConvGN, [512, 1, 1]],
   [-1, 1, MyTfBlock, [512, 4, 8, 8, 4]],  # 14

   [-1, 1, ConvGN, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, ConvGN, [256, 1, 1]],
   [-1, 1, MyTfBlock, [256, 8, 4, 8, 2]],  # 19 (P3/8-small)

   [-1, 1, ConvGN, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 1, ConvGN, [512, 1, 1]],
   [-1, 1, MyTfBlock, [512, 4, 8, 8, 4]],  # 23 (P4/16-medium)

   [-1, 1, ConvGN, [512, 3, 2]],
   [[-1, 9], 1, Concat, [1]],  # cat head P5
   [-1, 1, ConvGN, [1024, 1, 1]],
   [-1, 1, MyTfBlock, [1024, 2, 16, 8, 8]],  # 27 (P5/32-large)

   [[18, 22, 26], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]

